#include <stdio.h>
#include <conio.h>

main()
{
	//перечисление переменных
	int c, ch;
	int i;
	int m, n; //координаты в таблице
	//перечисление переменных

	//титульная страница
	gotoxy(22,12);
	printf("    Лабораторная работа №1");
	gotoxy(22,13);
	printf("Выполнил студент группы КМ-32");
	gotoxy(22,14);
	printf("       Драбчук Денис");
	//титульная страница
	getch();
	//программа
	m=0;
	n=0;
	clrscr();

	//чистая таблица
	printf("|--------------------------------------------------|\n");
	printf("|            Charackteristics of PECM              |\n");
	printf("|--------------------------------------------------|\n");
	printf("| Processor  |     Mgz    |    RAM     | Type      |\n");
	printf("|--------------------------------------------------|\n");
	printf("|            |            |            |           |\n");
	printf("|--------------------------------------------------|\n");
	printf("|            |            |            |           |\n");
	printf("|--------------------------------------------------|\n");
	printf("|            |            |            |           |\n");
	printf("|--------------------------------------------------|\n");
	printf("| Type C - CISC processor, R - RISC processor      |\n");
	printf("|--------------------------------------------------|\n");
	//чистая таблица

	//изменение параметров м н

	while (((c = getch()) != 27) && (c != 13))
	{
		switch (c) {
			case 72: m =(m + 2) % 3; break;
			case 80: m =(m + 4) % 3; break;
			case 75: n = (n + 3) % 4; break;
			case 77: n = (n + 5) % 4; break;
		default: break;
		}
		gotoxy(13*n + 2, 2*m + 6);
	}
	//изменение параметров м н

	//программа
	return 0;
}
